Tekla.Structures.Drawing.PickerInputThreePoints
The PickerInputThreePoints class represents a pick of three points in a view.
Used for values asked by UI.Picker.PickThreePoints(string FirstPrompt, string SecondPrompt, string ThirdPrompt, out Point FirstPickedPoint, out Point SecondPickedPoint, out Point ThirdPickedPoint, out ViewBase PickedView).

Tekla.Structures.Drawing.PickerInputThreePoints.FirstPickedPoint
The first picked point in the view coordinates.

Tekla.Structures.Drawing.PickerInputThreePoints.SecondPickedPoint
The second picked point in the view coordinates.

Tekla.Structures.Drawing.PickerInputThreePoints.ThirdPickedPoint
The third picked point in the view coordinates.

Tekla.Structures.Drawing.PickerInputThreePoints.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PickerInputThreePoints.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new PickerInputThreePoints instance with one point selected in a view.
pickedView: The view in which the pick occurred.
firstPickedPoint: The first picked point in the view coordinates.
secondPickedPoint: The second picked point in the view coordinates.
thirdPickedPoint: The third picked point in the view coordinates.